In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import LabelEncoder
from sklearn.metrics import accuracy_score

In [2]:
train_data=pd.read_csv('C:/Users/User/Documents/startech internship/machine learning/train.csv')
test_data=pd.read_csv('C:/Users/User/Documents/startech internship/machine learning/test.csv')

In [3]:
train_data=pd.read_csv('train.csv')

In [4]:
test_data=pd.read_csv('Test.csv')

In [5]:
train_data.head()

,S.No.,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
0,1,Tier 1,Manager,Non-Metro,"55,523.00",3,66,19,"71,406.58"
1,2,Tier 2,Executive,Metro,"57,081.00",1,84,18,"68,005.87"
2,3,Tier 2,Executive,Metro,"60,347.00",2,52,28,"76,764.02"
3,4,Tier 3,Executive,Metro,"49,010.00",2,81,33,"82,092.39"
4,5,Tier 3,Executive,Metro,"57,879.00",4,74,32,"73,878.10"

In [6]:
train_data.shape

(1338, 9)

In [7]:
train_data.describe()

             S.No.  Previous job changes  Graduation marks  Exp (Months)
count  1338.000000           1338.000000       1338.000000   1338.000000
mean    669.500000              2.525411         59.890882     39.207025
std     386.391641              1.123502         14.894696     14.049960
min       1.000000              1.000000         35.000000     18.000000
25%     335.250000              2.000000         47.000000     27.000000
50%     669.500000              3.000000         60.000000     39.000000
75%    1003.750000              4.000000         73.000000     51.000000
max    1338.000000              4.000000         85.000000     64.000000

In [8]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   S.No.                 1338 non-null   int64
 1   College               1338 non-null   object
 2   Role                  1338 non-null   object
 3   City type             1338 non-null   object
 4   Previous CTC          1338 non-null   object
 5   Previous job changes  1338 non-null   int64
 6   Graduation marks      1338 non-null   int64
 7   Exp (Months)          1338 non-null   int64
 8   CTC                   1338 non-null   object
dtypes: int64(4), object(5)
memory usage: 94.2+ KB

In [9]:
train_data.isnull().sum()

S.No.                   0
College                 0
Role                    0
City type               0
Previous CTC            0
Previous job changes    0
Graduation marks        0
Exp (Months)            0
CTC                     0
dtype: int64

In [10]:
train_data['Previous CTC']=train_data['Previous CTC'].str.replace(',','')
train_data['CTC']=train_data['CTC'].str.replace(',','')

In [11]:
lb=LabelEncoder()

In [12]:
train_data['College']=lb.fit_transform(train_data['College'])
train_data['Role']=lb.fit_transform(train_data['Role'])
train_data['City type']=lb.fit_transform(train_data['City type'])

In [13]:
train_data.head()

,S.No.,College,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
0,1,0,1,1,55523.00,3,66,19,71406.58
1,2,1,0,0,57081.00,1,84,18,68005.87
2,3,1,0,0,60347.00,2,52,28,76764.02
3,4,2,0,0,49010.00,2,81,33,82092.39
4,5,2,0,0,57879.00,4,74,32,73878.10

In [14]:
test_data.head()

,College,Role,City type,College_T1,College_T2,Role_Manager,City_Metro,previous CTC,previous job changes,Graduation marks,Exp,Actual CTC,Predicted CTC
0,Tier 1,Manager,Non-Metro,1,0,1,0,55523,3,66,19,71406.57653,NaN
1,Tier 2,Executive,Metro,0,1,0,1,57081,1,84,18,68005.87063,NaN
2,Tier 2,Executive,Metro,0,1,0,1,60347,2,52,28,76764.02028,NaN
3,Tier 3,Executive,Metro,0,0,0,1,49010,2,81,33,82092.38688,NaN
4,Tier 3,Executive,Metro,0,0,0,1,57879,4,74,32,73878.09773,NaN

In [15]:
test_data.drop(['College_T1','College_T2','Role_Manager','City_Metro','Predicted CTC'],axis=1,inplace=True)

In [16]:
test_data.head()

,College,Role,City type,previous CTC,previous job changes,Graduation marks,Exp,Actual CTC
0,Tier 1,Manager,Non-Metro,55523,3,66,19,71406.57653
1,Tier 2,Executive,Metro,57081,1,84,18,68005.87063
2,Tier 2,Executive,Metro,60347,2,52,28,76764.02028
3,Tier 3,Executive,Metro,49010,2,81,33,82092.38688
4,Tier 3,Executive,Metro,57879,4,74,32,73878.09773

In [17]:
test_data['College']=lb.fit_transform(test_data['College'])
test_data['Role']=lb.fit_transform(test_data['Role'])
test_data['City type']=lb.fit_transform(test_data['City type'])

In [18]:
test_data.head()

,College,Role,City type,previous CTC,previous job changes,Graduation marks,Exp,Actual CTC
0,0,1,1,55523,3,66,19,71406.57653
1,1,0,0,57081,1,84,18,68005.87063
2,1,0,0,60347,2,52,28,76764.02028
3,2,0,0,49010,2,81,33,82092.38688
4,2,0,0,57879,4,74,32,73878.09773

In [19]:
train_data.columns

Index(['S.No.', 'College', 'Role', 'City type', 'Previous CTC',
       'Previous job changes', 'Graduation marks', 'Exp (Months)', 'CTC'],
      dtype='object')

In [20]:
lg=LinearRegression()

In [22]:
lg.fit(train_data[['College', 'Role', 'City type', 'Previous CTC', 'Previous job changes', 'Graduation marks', 'Exp (Months)']],train_data['CTC'])

LinearRegression()

In [23]:
lg.coef_

array([-2.64996949e+03,  1.91418969e+04, -4.07248704e+03,  4.01361890e-01,
       -5.15882094e+01, -5.61343828e+00,  2.62541271e+02])

In [24]:
lg.intercept_

43427.221142148206

In [25]:
test_data.columns

Index(['College', 'Role', 'City type', 'previous CTC', 'previous job changes',
       'Graduation marks', 'Exp', 'Actual CTC'],
      dtype='object')

In [26]:
predicted=lg.predict(test_data[['College', 'Role', 'City type', 'previous CTC', 'previous job changes', 'Graduation marks', 'Exp', ]])

C:\Users\User\anaconda3\lib\site-packages\sklearn\base.py:493: FutureWarning: The feature names should match those that were passed during fit. Starting version 1.2, an error will be raised.
Feature names unseen at fit time:
- Exp
- previous CTC
- previous job changes
Feature names seen at fit time, yet now missing:
- Exp (Months)
- Previous CTC
- Previous job changes

  warnings.warn(message, FutureWarning)

In [27]:
predicted

array([85244.47979502, 67890.01554768, 71954.31800301, ...,
       65982.26630138, 65679.6655605 , 89694.86283963])

In [28]:
New_CTC=pd.DataFrame(predicted,columns=['ctc'])

In [29]:
New_CTC.head()

            ctc
0  85244.479795
1  67890.015548
2  71954.318003
3  65904.025402
4  69137.280385

In [30]:
test_data['CTC']=New_CTC

In [34]:
test_data

,College,Role,City type,previous CTC,previous job changes,Graduation marks,Exp,Actual CTC,CTC
0,0,1,1,55523,3,66,19,71406.57653,85244.479795
1,1,0,0,57081,1,84,18,68005.87063,67890.015548
2,1,0,0,60347,2,52,28,76764.02028,71954.318003
3,2,0,0,49010,2,81,33,82092.38688,65904.025402
4,2,0,0,57879,4,74,32,73878.09773,69137.280385
...,...,...,...,...,...,...,...,...,...
1333,2,0,0,59661,4,68,50,69712.40366,74611.930775
1334,0,0,1,53714,1,67,18,69298.75010,65211.540970
1335,1,0,1,61957,1,47,18,66397.77069,65982.266301
1336,0,0,1,53203,3,69,21,64044.38295,65679.665560
1337,2,1,1,51820,1,47,61,83346.06096,89694.862840